# UsDollar Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..UsDollar Property
SymbolTypeId Class See Also
---
Symbol $, indicating unit Currency.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId UsDollar { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UsDollar As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ UsDollar {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace